package main

import (
	"fmt"
)

func aaaaaa() {

	fmt.Println(binarySearch([]int{0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
		10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
		20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
		30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
		40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
		50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
		60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
		70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
		80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
		90, 91, 92, 93, 94, 95, 96, 97, 98, 99,
	}, 56))

}

func binarySearch(slice []int, target int) int {

	midle := len(slice) / 2 // Находим середину слайса, для слайса из трех (нечетное число) элементов это 2 элемент, для слайса из 4 (четное число) - 3 элемент

	if slice[midle] == target {
		return midle // Проверяем является ли середина искомым значением
	} else {

		if len(slice) == 1 {
			return -1 // возврат -1 если слайс уменьшился до 1 элемента и он не является искомым
		}

		if target > slice[midle] {
			return binarySearch(slice[midle+1:], target) + midle + 1 // рекурсивный вызов если элемент в середине меньше искомого
		} else {
			return binarySearch(slice[:midle], target) // если больше
		}
	}

}
